devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                        memcpy(dst, buffer + (lseek % SECTOR_SIZE), rest);
                        dst       += rest;
                        recv_data += rest;
                        lseek     += rest;
                }
        }

        free(buffer);

        return recv_data;
}

//==============================================================================
/**
 * @brief Function write whole sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *src             source
 * @param[in]   nsectors        sectors to read
 * @param[in]   lseek           file index
 *
 * @retval number of written sectors
 */
//==============================================================================
static size_t write_whole_sectors(struct sdspi_data *hdl, const void *src, size_t nsectors, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_type & CT_BLOCK) {
                lseek >>= 9;    /* divide by 512 */
        }

        /* 1 sector to read */
        if (nsectors == 1) {
                if (send_cmd(hdl, CMD24, (u32_t)lseek) == 0) {
                        if (transmit_data_block(src, 0xFE)) {
                                n = 1;
                        }
                }
        } else {
                if (hdl->card_type & CT_SDC) {
                        send_cmd(hdl, ACMD23, nsectors);
                }

                if (send_cmd(hdl, CMD25, (u32_t)lseek) == 0) {
                        do {
                                if (!transmit_data_block(src, 0xFC)) {
                                        break;
                                }

                                src += SECTOR_SIZE;
                        } while (++n < nsectors);

                        /* stop transmission */
                        if (!transmit_data_block(NULL, 0xFD)) {
                                n = 0;
                        }
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief Function write only selected data to sectors
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *src             source
 * @param[in]   size            number of bytes to read
 * @param[in]   lseek           file index
 *
 * @retval number of read bytes
 */
//==============================================================================
static size_t write_partial_sectors(struct sdspi_data *hdl, const void *src, size_t size, u64_t lseek)
{
        return 0;
}

//==============================================================================
/**
 * @brief Function initialize card
 *
 * @param[in] *hdl      SD module data
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t initialize_card(struct sdspi_data *hdl)
{
#include "core/io.h" /* FIXME -- niepotrzebne */
        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        for (int n = 0; n < 10; n++) {
                spi_rw(0xFF);
        }

        int  timeout = 2 * SDSPI_WAIT_TIMEOUT;
        u8_t cmd;
        u8_t OCR[4];

        hdl->card_type = 0;
        hdl->card_initialized = false;

        if (send_cmd(hdl, CMD0, 0) == 0x01) {
                if (send_cmd(hdl, CMD8, 0x1AA) == 0x01) { /* check SDHC card */
                        for (int n = 0; n < 4; n++) {
                                OCR[n] = spi_rw(0xFF);
                        }

                        if (OCR[2] == 0x01 && OCR[3] == 0xAA) {
                                while (--timeout && send_cmd(hdl, ACMD41, 1UL << 30)) {
                                        sleep_ms(1);
                                }

                                if (timeout && send_cmd(hdl, CMD58, 0) == 0) {
                                        for (int n = 0; n < 4; n++) {
                                                OCR[n] = spi_rw(0xFF);
                                        }

                                        hdl->card_type = (OCR[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
                                }
                        }
                } else { /* SDSC or MMC */
                        if (send_cmd(hdl, ACMD41, 0) <= 0x01)   {
                                hdl->card_type = CT_SD1;
                                cmd = ACMD41;   /* SDSC */
                        } else {
                                hdl->card_type = CT_MMC;
                                cmd = CMD1;     /* MMC */
                        }

                        /* Wait for leaving idle state */
                        while (timeout && send_cmd(hdl, cmd, 0)) {
                                timeout--;
                                sleep_ms(1);
                        }

                        /* set R/W block length to 512 */
                        if (!timeout || send_cmd(hdl, CMD16, SECTOR_SIZE) != 0) {
                                hdl->card_type = 0;
                        }
                }

                if (timeout) {
                        hdl->card_initialized = true;
                }
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);

        if (hdl->card_initialized == false) {
                printk(FONT_COLOR_RED"Card not initialized...\n"RESET_ATTRIBUTES);
                return STD_RET_ERROR;
        } else {
                printk("Card initialized. Card type: 0x%x\n", hdl->card_type);
                return STD_RET_OK;
        }
}

//==============================================================================
/**
 * @brief Function detect partitions
 *
 * @param[in] *hdl      SD module data
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t detect_partitions(struct sdspi_data *hdl) /* TODO detect_partitions */
{
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Read data from card
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   size            item size
 * @param[in]   nitems          n-items to read
 * @param[in]   lseek           file index
 *
 * @retval number of read nitems
 */
//==============================================================================
static size_t card_read(struct sdspi_data *hdl, void *dst, size_t size, size_t nitems, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_initialized == false) {
                return 0;
        }

        /* whole sector(s) read */
        if (((size * nitems) % SECTOR_SIZE == 0) && (lseek % SECTOR_SIZE == 0)) {

                n  = read_whole_sectors(hdl, dst, (size * nitems) / SECTOR_SIZE, lseek);
                n *= SECTOR_SIZE / size;

        } else {
                n  = read_partial_sectors(hdl, dst, size * nitems, lseek);
                n /= size;
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);
        return n;
}

//==============================================================================
/**
 * @brief Write data to card
 *
 * @param[in] *hdl              driver's memory handle
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  nitems           n-items to write
 * @param[in]  lseek            file index
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t card_write(struct sdspi_data *hdl, const void *src, size_t size, size_t nitems, u64_t lseek)
{
        size_t n = 0;

        if (hdl->card_initialized == false) {
                return 0;
        }

        /* whole sector(s) read */
        if (((size * nitems) % SECTOR_SIZE == 0) && (lseek % SECTOR_SIZE == 0)) {

                n  = write_whole_sectors(hdl, src, (size * nitems) / SECTOR_SIZE, lseek);
                n *= SECTOR_SIZE / size;

        } else {
                n  = write_partial_sectors(hdl, src, size * nitems, lseek);
                n /= size;
        }

        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
        spi_rw(0xFF);
        return n;
}

#ifdef __cplusplus
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
